/*
4. Попробовать одно- и двух- направленные очереди (набить и перебрать элементы)
- создать по два объекта очередей Queue<> и Dequeue<> для хранения сущностей Entity
- заполнить Queue через add() и offer() вплоть до заполнения, посмотреть результат
  - посмотреть элемент в голове заполненной очереди через element() и peek()
  - удалить все элементы из очереди методами remove() и poll() с печатью возвращенных значений из возврата, посмотреть результат
  - посмотреть элемент в голове пустой очереди через element() и peek()
- заполнить Dequeue 10-ю элементами до полного состояния любым методом и попробовать добавить излишний через addFirst() и offerLast()
  - попробовать посмотреть не удаляя элемент через peekFirst() getLast()
  - удалить с печатью возврата все элементы любым способом, после удаления попробовать методы pollFirst() и removeLast()
  - посмотреть голову/хвост пустой очереди getFirst() и peekLast()
*/

package testing;

public class LevelFive {
}
