/*
3. Замерить и сравнить работу TreeSet и HashSet аналогично (1)
- реализовать расширение класса Entity с определённым методом hashCode
- создать хэш-ножество HashSet и древовидное множество TreeSet
- заполнить каждое множество на 100 элементов
- перебрать с замером времени каждое множество итератором и произваольным доступом
- проверить скорость вcтроенного двоичного поиска на обоих множествах
- проверить скорость самописного двоичного поиска на обоих множествах
- посмотреть время сортировки HeshSet
* */

package testing;

public class LevelFour {
}
