/*
5.  Улучшить навыки работы с сеточно-контейнерной компоновкой.
    Разработать и реализовать приложение для просмотра изображений в выбранной дериктории
  - сформировать главное окно
  - добавить в главное окно изображение
  - добавить в окно панель с лентой окружающих изображений
  - добавить в окно имя просматриваемо файла, его метаинформацию
  - добавить кнопки пролистывания, привязать к ним нажатия клавиш
  - выбор лиректории провести через главное меню
*/

package testing.LevelFive;

public class LevelFive {
}
